# Pandas Library

In [1]:
import pandas as pd    #used for file handling
import warnings 
warnings.filterwarnings('ignore')
from pandas import Series, DataFrame

C:\Users\uSER\AppData\Local\Temp\ipykernel_8592\501393285.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd    #used for file handling

In [2]:
s1 = Series(range(0,4))
s2 = Series(range(1,5))
s3 = s1 + s2
s4 = Series(['a', 'b'])*3
print('\n\t',s1,end=' ')
print(s2,end=' ')
print(s3,end=' ')
print(s4,end=' ')
s2.index

	 0    0
1    1
2    2
3    3
dtype: int64 0    1
1    2
2    3
3    4
dtype: int64 0    1
1    3
2    5
3    7
dtype: int64 0    aaa
1    bbb
dtype: object

RangeIndex(start=0, stop=4, step=1)

In [3]:
df = pd.read_csv(r"C:\Users\uSER\Downloads\california_housing_test.csv")
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
3,-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
4,-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0
...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23.0,1450.0,642.0,1258.0,607.0,1.1790,225000.0
2996,-118.14,34.06,27.0,5257.0,1082.0,3496.0,1036.0,3.3906,237200.0
2997,-119.70,36.30,10.0,956.0,201.0,693.0,220.0,2.2895,62000.0
2998,-117.12,34.10,40.0,96.0,14.0,46.0,14.0,3.2708,162500.0
2999,-119.63,34.42,42.0,1765.0,263.0,753.0,260.0,8.5608,500001.0

In [4]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [5]:
df.index

RangeIndex(start=0, stop=3000, step=1)

The index object: The pandas index provides the axis labels for the series and dataframme objects. It can only contain hashable objects. A pandas Series has one dimension and DataFrame has two dimensions

#### is_monotonic_decreasing and is_monotonic_increasing functions only works on numerical values
#### It also fails if header value is false

In [6]:
df.columns.is_monotonic_decreasing

False

In [7]:
df.columns.is_monotonic_increasing

False

In [8]:
df.index.is_monotonic_decreasing

False

In [9]:
df.index.is_monotonic_increasing

True

In [10]:
df.index.has_duplicates

False

In [11]:
df.columns.has_duplicates

False

In [12]:
df.index.nlevels

1

values() is not callable because values() is not function it is datamember values

In [13]:
df['latitude'].values

array([37.37, 34.26, 33.78, ..., 36.3 , 34.1 , 34.42])

In [14]:
df['latitude'].equals(0)

False

In [15]:
df.equals(0)

False

In [16]:
df = pd.read_csv(r"C:\Users\uSER\Downloads\california_housing_test.csv") 
df = pd.read_csv(r"C:\Users\uSER\Downloads\california_housing_test.csv", header=0,
 index_col=0, quotechar='"', sep=':',
 na_values = ['na', '-', '.', '']) 
df

Empty DataFrame
Columns: []
Index: [-122.050000,37.370000,27.000000,3885.000000,661.000000,1537.000000,606.000000,6.608500,344700.000000, -118.300000,34.260000,43.000000,1510.000000,310.000000,809.000000,277.000000,3.599000,176500.000000, -117.810000,33.780000,27.000000,3589.000000,507.000000,1484.000000,495.000000,5.793400,270500.000000, -118.360000,33.820000,28.000000,67.000000,15.000000,49.000000,11.000000,6.135900,330000.000000, -119.670000,36.330000,19.000000,1241.000000,244.000000,850.000000,237.000000,2.937500,81700.000000, -119.560000,36.510000,37.000000,1018.000000,213.000000,663.000000,204.000000,1.663500,67000.000000, -121.430000,38.630000,43.000000,1009.000000,225.000000,604.000000,218.000000,1.664100,67000.000000, -120.650000,35.480000,19.000000,2310.000000,471.000000,1341.000000,441.000000,3.225000,166900.000000, -122.840000,38.400000,15.000000,3080.000000,617.000000,1446.000000,599.000000,3.669600,194400.000000, -118.020000,34.080000,31.000000,2402.000000,632.000000,2830.000000,603.000000,2.333300,164200.000000, -118.240000,33.980000,45.000000,972.000000,249.000000,1288.000000,261.000000,2.205400,125000.000000, -119.120000,35.850000,37.000000,736.000000,166.000000,564.000000,138.000000,2.416700,58300.000000, -121.930000,37.250000,36.000000,1089.000000,182.000000,535.000000,170.000000,4.690000,252600.000000, -117.030000,32.970000,16.000000,3936.000000,694.000000,1935.000000,659.000000,4.562500,231200.000000, -117.970000,33.730000,27.000000,2097.000000,325.000000,1217.000000,331.000000,5.712100,222500.000000, -117.990000,33.810000,42.000000,161.000000,40.000000,157.000000,50.000000,2.200000,153100.000000, -120.810000,37.530000,15.000000,570.000000,123.000000,189.000000,107.000000,1.875000,181300.000000, -121.200000,38.690000,26.000000,3077.000000,607.000000,1603.000000,595.000000,2.717400,137500.000000, -118.880000,34.210000,26.000000,1590.000000,196.000000,654.000000,199.000000,6.585100,300000.000000, -122.590000,38.010000,35.000000,8814.000000,1307.000000,3450.000000,1258.000000,6.172400,414300.000000, -122.150000,37.750000,40.000000,1445.000000,256.000000,849.000000,255.000000,3.891300,126300.000000, -121.370000,38.680000,36.000000,1775.000000,296.000000,937.000000,305.000000,3.178600,83400.000000, -118.160000,34.070000,47.000000,2994.000000,543.000000,1651.000000,561.000000,3.864400,241500.000000, -122.200000,37.790000,45.000000,2021.000000,528.000000,1410.000000,480.000000,2.778800,115400.000000, -117.280000,33.280000,13.000000,6131.000000,1040.000000,4049.000000,940.000000,3.815600,150700.000000, -118.030000,34.160000,36.000000,1401.000000,218.000000,667.000000,225.000000,7.161500,484700.000000, -122.420000,37.760000,52.000000,3587.000000,1030.000000,2259.000000,979.000000,2.540300,250000.000000, -118.390000,33.990000,32.000000,2612.000000,418.000000,1030.000000,402.000000,6.603000,369200.000000, -118.450000,34.070000,19.000000,4845.000000,1609.000000,3751.000000,1539.000000,1.583000,350000.000000, -118.480000,34.010000,30.000000,3078.000000,954.000000,1561.000000,901.000000,3.485200,425000.000000, -119.350000,36.330000,14.000000,1195.000000,220.000000,568.000000,229.000000,3.148600,105600.000000, -118.300000,33.910000,34.000000,1617.000000,493.000000,1530.000000,500.000000,2.618200,172600.000000, -121.130000,39.310000,17.000000,3442.000000,705.000000,1693.000000,619.000000,2.810200,128900.000000, -118.080000,34.550000,5.000000,16181.000000,2971.000000,8152.000000,2651.000000,4.523700,141800.000000, -118.320000,33.940000,38.000000,1067.000000,170.000000,499.000000,169.000000,4.638900,183800.000000, -118.110000,34.000000,33.000000,2886.000000,726.000000,2650.000000,728.000000,2.625000,178700.000000, -122.530000,37.970000,52.000000,1560.000000,451.000000,700.000000,419.000000,2.512500,270800.000000, -118.020000,33.920000,34.000000,1478.000000,251.000000,956.000000,277.000000,5.523800,185300.000000, -118.050000,33.930000,31.000000,894.000000,203.000000,883.000000,190.000000,3.677100,141500.000000, -119.010000,34.230000,11.000000,5785.000000,1035.000000,2760.000000,985.000000,4.693000,232200.000000, -119.320000,36.200000,15.000000,1562.000000,275.000000,961.000000,287.000000,3.423100,83300.000000, -116.920000,32.770000,16.000000,2770.000000,406.000000,1269.000000,429.000000,6.678300,275000.000000, -118.060000,34.150000,37.000000,1980.000000,226.000000,697.000000,226.000000,15.000100,500001.000000, -117.270000,34.090000,36.000000,848.000000,186.000000,737.000000,169.000000,0.983800,79300.000000, -118.230000,34.130000,48.000000,1308.000000,286.000000,835.000000,294.000000,4.289100,214800.000000, -117.240000,33.170000,4.000000,9998.000000,1874.000000,3925.000000,1672.000000,4.282600,237500.000000, -121.910000,37.440000,24.000000,1212.000000,251.000000,799.000000,242.000000,5.080800,212500.000000, -118.290000,33.940000,47.000000,1782.000000,338.000000,1003.000000,329.000000,2.539800,105700.000000, -121.350000,38.000000,6.000000,1649.000000,369.000000,732.000000,350.000000,3.423100,123800.000000, -117.990000,33.780000,19.000000,7399.000000,1698.000000,3554.000000,1593.000000,3.104900,173900.000000, -120.990000,37.700000,14.000000,9849.000000,1887.000000,4356.000000,1780.000000,3.587700,160900.000000, -119.420000,35.970000,21.000000,554.000000,121.000000,426.000000,122.000000,2.351600,47500.000000, -122.210000,37.800000,39.000000,2003.000000,500.000000,1109.000000,464.000000,3.068200,156500.000000, -118.170000,33.800000,26.000000,1589.000000,380.000000,883.000000,366.000000,3.531300,187500.000000, -117.900000,34.090000,39.000000,1726.000000,333.000000,892.000000,335.000000,4.340900,191800.000000, -117.990000,33.930000,36.000000,1287.000000,233.000000,779.000000,229.000000,4.852300,175800.000000, -121.420000,38.720000,10.000000,3054.000000,528.000000,1932.000000,510.000000,3.090300,91900.000000, -118.770000,34.260000,26.000000,3038.000000,468.000000,1825.000000,468.000000,5.638500,196900.000000, -121.930000,37.330000,44.000000,1449.000000,291.000000,676.000000,282.000000,3.575000,292200.000000, -121.820000,37.250000,16.000000,2650.000000,600.000000,1969.000000,586.000000,3.946100,194300.000000, -122.290000,37.560000,36.000000,805.000000,140.000000,445.000000,139.000000,5.822100,289400.000000, -121.780000,37.230000,18.000000,1747.000000,317.000000,1055.000000,285.000000,5.898000,229100.000000, -118.410000,34.000000,35.000000,1062.000000,305.000000,1026.000000,307.000000,2.715300,265500.000000, -121.670000,40.870000,31.000000,1581.000000,299.000000,776.000000,287.000000,2.906300,77800.000000, -118.000000,33.920000,26.000000,2830.000000,399.000000,1204.000000,404.000000,6.127300,289600.000000, -117.220000,32.730000,38.000000,3966.000000,768.000000,1640.000000,729.000000,3.840900,291400.000000, -121.080000,37.690000,19.000000,6473.000000,1212.000000,3559.000000,1123.000000,3.224600,129300.000000, -117.530000,33.920000,12.000000,2290.000000,319.000000,728.000000,228.000000,6.156100,233500.000000, -117.460000,34.080000,18.000000,3830.000000,750.000000,2767.000000,702.000000,3.660200,120700.000000, -117.970000,33.860000,35.000000,1691.000000,367.000000,1265.000000,378.000000,3.585500,174300.000000, -121.920000,37.330000,52.000000,2125.000000,382.000000,930.000000,387.000000,5.283100,299500.000000, -118.200000,34.040000,44.000000,1582.000000,544.000000,1998.000000,515.000000,1.688800,125000.000000, -118.060000,33.800000,22.000000,1892.000000,442.000000,1015.000000,404.000000,4.137900,212500.000000, -122.050000,37.360000,34.000000,2400.000000,419.000000,1017.000000,384.000000,4.136900,316900.000000, -123.790000,39.500000,24.000000,1421.000000,291.000000,588.000000,274.000000,2.325000,157300.000000, -120.790000,37.490000,44.000000,1186.000000,225.000000,687.000000,234.000000,3.416700,160700.000000, -121.890000,37.350000,47.000000,2879.000000,631.000000,2229.000000,606.000000,3.259900,183100.000000, -118.430000,34.200000,29.000000,3051.000000,694.000000,1942.000000,679.000000,3.111800,238100.000000, -118.750000,34.170000,18.000000,6217.000000,858.000000,2703.000000,834.000000,6.807500,325900.000000, -122.470000,37.990000,22.000000,7274.000000,1002.000000,2468.000000,957.000000,7.494000,439200.000000, -120.690000,37.400000,46.000000,860.000000,130.000000,496.000000,147.000000,3.516700,137500.000000, -118.280000,34.050000,44.000000,968.000000,384.000000,1805.000000,375.000000,1.480100,212500.000000, -118.440000,34.250000,35.000000,1583.000000,324.000000,1481.000000,351.000000,3.700000,176000.000000, -122.050000,38.260000,21.000000,7195.000000,1416.000000,3927.000000,1377.000000,3.091200,126300.000000, -121.990000,37.350000,18.000000,1712.000000,509.000000,972.000000,467.000000,4.397100,238900.000000, -121.020000,37.680000,28.000000,2875.000000,560.000000,1608.000000,558.000000,3.548900,106400.000000, -119.850000,36.740000,35.000000,1191.000000,190.000000,537.000000,182.000000,3.537500,96700.000000, -118.020000,34.080000,28.000000,2769.000000,631.000000,2452.000000,581.000000,2.607100,175900.000000, -123.520000,41.010000,17.000000,1564.000000,345.000000,517.000000,222.000000,2.154200,83800.000000, -122.400000,37.620000,44.000000,1619.000000,362.000000,1064.000000,335.000000,4.023800,224200.000000, -118.130000,34.150000,24.000000,1125.000000,341.000000,579.000000,321.000000,2.812500,141700.000000, -122.000000,37.980000,32.000000,1013.000000,169.000000,436.000000,173.000000,5.111800,226900.000000, -118.450000,34.250000,36.000000,1453.000000,270.000000,808.000000,275.000000,4.383900,204600.000000, -117.500000,33.870000,4.000000,6755.000000,1017.000000,2866.000000,850.000000,5.049300,239800.000000, -122.220000,37.840000,50.000000,2935.000000,473.000000,1031.000000,479.000000,7.500000,295200.000000, -119.820000,36.640000,30.000000,1694.000000,312.000000,1008.000000,321.000000,2.246600,96000.000000, -120.210000,36.770000,20.000000,1745.000000,348.000000,1093.000000,302.000000,2.319400,90600.000000, -120.970000,38.420000,16.000000,1748.000000,322.000000,4930.000000,287.000000,4.302900,121900.000000, -121.190000,38.870000,20.000000,3118.000000,500.000000,1405.000000,519.000000,6.000000,209400.000000, -118.200000,33.770000,52.000000,1375.000000,457.000000,1089.000000,317.000000,2.234400,200000.000000, ...]

[3000 rows x 0 columns]

In [17]:
from io import StringIO
data = """, Animal, Cuteness, Desirable
row-1, dog, 8.7, True
row-2, bat, 2.6, False """
df = pd.read_csv(StringIO(data),
                header=0, index_col=0,
                skipinitialspace=True)
df

      Animal  Cuteness Desirable
row-1    dog       8.7      True
row-2    bat       2.6    False

In [18]:
workbook = pd.ExcelFile(r"C:\Users\uSER\Downloads\Sample_Excel.xlsx")
dictionary= {}
for sheet_name in workbook.sheet_names:
    df = workbook.parse(sheet_name)
    dictionary[sheet_name] = df
dictionary

{'Sheet1':         Name  Score
 0     Raksha    8.3
 1    Janhavi    8.8
 2  Shubhangi    9.6
 3     Shruti    9.1}

## Dictionary to series

In [19]:
s1 = Series({'Tom':1, 'Dick':4, 'Har':9})
s2 = Series({'Tom':3, 'Dick':2, 'Har':5})
print(s1.index)
df1 = pd.concat({'A':s1, 'B':s2}, axis=1)
print('\ndf1: Column wise\n',df1)
df2 = pd.concat({'A':s1, 'B':s2}, axis=0)
print('\ndf2: Row wise\n',df2)

Index(['Tom', 'Dick', 'Har'], dtype='object')

df1: Column wise
       A  B
Tom   1  3
Dick  4  2
Har   9  5

df2: Row wise
 A  Tom     1
   Dick    4
   Har     9
B  Tom     3
   Dick    2
   Har     5
dtype: int64

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Score   4 non-null      float64
dtypes: float64(1), object(1)
memory usage: 196.0+ bytes

In [21]:
n=4
dfh = df.head(n)
dft = df.tail(n)
dfs = df.describe()
df_iloc = df.iloc[:5, :5]
print(dfh)
print(dft)
print(dfs)
print(df_iloc)

        Name  Score
0     Raksha    8.3
1    Janhavi    8.8
2  Shubhangi    9.6
3     Shruti    9.1
        Name  Score
0     Raksha    8.3
1    Janhavi    8.8
2  Shubhangi    9.6
3     Shruti    9.1
          Score
count  4.000000
mean   8.950000
std    0.544671
min    8.300000
25%    8.675000
50%    8.950000
75%    9.225000
max    9.600000
        Name  Score
0     Raksha    8.3
1    Janhavi    8.8
2  Shubhangi    9.6
3     Shruti    9.1

In [22]:
dft = df.T
dft

            0        1          2       3
Name   Raksha  Janhavi  Shubhangi  Shruti
Score     8.3      8.8        9.6     9.1

In [23]:
l = df.axes
(r,c) = df.axes
l

[RangeIndex(start=0, stop=4, step=1), Index(['Name', 'Score'], dtype='object')]

In [24]:
s = df.dtypes
s

Name      object
Score    float64
dtype: object

In [25]:
b = df.empty
b

False

In [26]:
i = df.ndim
i

2

In [27]:
t = df.shape
t

(4, 2)

In [28]:
i = df.size
i

8

In [29]:
a = df.values
a

array([['Raksha', 8.3],
       ['Janhavi', 8.8],
       ['Shubhangi', 9.6],
       ['Shruti', 9.1]], dtype=object)

In [30]:
type(df)

pandas.core.frame.DataFrame

In [31]:
type(df.values)

numpy.ndarray

In [32]:
dfc = df
dfc

        Name  Score
0     Raksha    8.3
1    Janhavi    8.8
2  Shubhangi    9.6
3     Shruti    9.1

In [33]:
dfc = df.copy()
dfc

        Name  Score
0     Raksha    8.3
1    Janhavi    8.8
2  Shubhangi    9.6
3     Shruti    9.1

In [34]:
dfr = df.rank()
dfr

   Name  Score
0   2.0    1.0
1   1.0    2.0
2   4.0    4.0
3   3.0    3.0

dfs = df.sort_values()
dfs

In [35]:
dfc = df.astype(str)
dfc

        Name Score
0     Raksha   8.3
1    Janhavi   8.8
2  Shubhangi   9.6
3     Shruti   9.1

In [36]:
df.to_csv("name.csv", encoding = 'utf-8')
df

        Name  Score
0     Raksha    8.3
1    Janhavi    8.8
2  Shubhangi    9.6
3     Shruti    9.1

In [37]:
from pandas import ExcelWriter
writer = ExcelWriter('filename.xlsx')
df1 = pd.DataFrame({'Data':[11,12,13,14]})
df1.to_excel(writer, 'Sheet1')
df2.to_excel(writer, 'Sheet2')
writer.close()

In [38]:
df.columns

Index(['Name', 'Score'], dtype='object')

In [39]:
df.columns[0]

'Name'

In [40]:
df.columns.tolist()

['Name', 'Score']

In [41]:
df.rename(columns = {'old':'new'}, inplace=True)
df = df.rename(columns={'Name':'Student'})
df

     Student  Score
0     Raksha    8.3
1    Janhavi    8.8
2  Shubhangi    9.6
3     Shruti    9.1

In [42]:
s = df['Student']    #returns series

In [43]:
type(s)

pandas.core.series.Series

In [44]:
df = df[['Student']]    #returns DataFrame

In [45]:
type(df)

pandas.core.frame.DataFrame

In [46]:
#df = df[['Score','Age']]

s = df['Student']
df.Student = df.

import numpy as np
s1 = Series({'Tom':1, 'Dick':4, 'Har':9})
s2 = Series({'Tom':3, 'Dick':2, 'Har':5})
df1 = pd.concat({'A':s1, 'B':s2}, axis=1)
df2 = pd.concat({'B':s1, 'A':s2}, axis=1)
df['Age'] = range(len(df))
df['Age'] = np.repeat(np.nan,len(df))
df['random'] = np.random.rand(len(df))
df['index_as_col'] = df.index
df1[['A','B']] = df2[['A','B']]
df3 = df1.concat(df2)

df[['Age', 'Score']] = df[['Score', 'Age']]

In [50]:
data = df.copy()
data = data.drop('Student', axis=1)
data
df

     Student
0     Raksha
1    Janhavi
2  Shubhangi
3     Shruti

In [48]:
df = df.drop(['Score', 'Age'], axis=1)
s = df.pop('Age')
del df['Age']
df.drop(df.columns[0], inplace=True)

KeyError: "['Score', 'Age'] not found in axis"